In [4]:
import pandas as pd

In [5]:
CCTV_Seoul = pd.read_excel("../data/01.Seoul_CCTV.xlsx")
CCTV_Seoul.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,NaN,"(단위 : 대, '23.12.31.일 기준)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,순번,구분,총 계,2015년 이전\n설치된 CCTV,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
2,NaN,NaN,계,99515,8759,5725,8537,10770,10619,12855,11525,9358,9379,11988
3,NaN,1,종로구,2031,549,158,128,143,142,67,237,82,225,300
4,NaN,2,중 구,2718,275,236,239,372,386,155,364,419,137,135

In [6]:
CCTV_Seoul = pd.read_excel("../data/01.Seoul_CCTV.xlsx", header = 2, usecols="C:N")
CCTV_Seoul.head()

,구분,총 계,2015년 이전\n설치된 CCTV,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
0,계,99515,8759,5725,8537,10770,10619,12855,11525,9358,9379,11988
1,종로구,2031,549,158,128,143,142,67,237,82,225,300
2,중 구,2718,275,236,239,372,386,155,364,419,137,135
3,용산구,3258,88,38,295,491,147,335,473,486,500,405
4,성동구,4409,190,352,278,939,457,640,483,366,233,471

In [7]:
CCTV_Seoul.columns

Index(['구분', '총 계', '2015년 이전\n설치된 CCTV', '2015년', '2016년', '2017년', '2018년',
       '2019년', '2020년', '2021년', '2022년', '2023년'],
      dtype='object')

In [8]:
CCTV_Seoul.rename(columns = {CCTV_Seoul.columns[0]: "구별"}, inplace=True)
CCTV_Seoul.rename(columns = {CCTV_Seoul.columns[2]: "2015년도 이전"}, inplace=True)
CCTV_Seoul.head()

,구별,총 계,2015년도 이전,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
0,계,99515,8759,5725,8537,10770,10619,12855,11525,9358,9379,11988
1,종로구,2031,549,158,128,143,142,67,237,82,225,300
2,중 구,2718,275,236,239,372,386,155,364,419,137,135
3,용산구,3258,88,38,295,491,147,335,473,486,500,405
4,성동구,4409,190,352,278,939,457,640,483,366,233,471

In [9]:
CCTV_Seoul.tail()

,구별,총 계,2015년도 이전,2015년,2016년,2017년,2018년,2019년,2020년,2021년,2022년,2023년
21,관악구,5772,774,447,607,675,663,889,404,549,135,629
22,서초구,5395,227,552,514,1022,422,339,419,565,878,457
23,강남구,7721,672,814,1280,981,735,787,913,505,588,446
24,송파구,4031,223,183,126,227,526,1050,237,151,431,877
25,강동구,3549,571,154,202,273,377,356,614,262,381,359

In [10]:
pop_Seoul = pd.read_excel("../data/01.Seoul_Population.xlsx")
pop_Seoul.head()

/usr/local/Caskroom/miniconda/base/envs/ds_study/lib/python3.8/site-packages/openpyxl/styles/stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

,동별(1),동별(2),2024 1/4,2024 1/4.1,2024 1/4.2,2024 1/4.3,2024 1/4.4,2024 1/4.5,2024 1/4.6,2024 1/4.7,2024 1/4.8,2024 1/4.9,2024 1/4.10,2024 1/4.11
0,동별(1),동별(2),세대 (세대),계 (명),계 (명),계 (명),한국인 (명),한국인 (명),한국인 (명),등록외국인 (명),등록외국인 (명),등록외국인 (명),세대당인구 (명),65세이상고령자 (명)
1,동별(1),동별(2),소계,소계,남자,여자,소계,남자,여자,소계,남자,여자,소계,소계
2,합계,소계,4485819,9635445,4644729,4990716,9384739,4536128,4848611,250706,108601,142105,2.09,1768948
3,합계,종로구,72404,150550,71861,78689,139498,67228,72270,11052,4633,6419,1.93,29127
4,합계,중구,65132,131812,63506,68306,121602,58767,62835,10210,4739,5471,1.87,26302

In [11]:
pop_Seoul = pd.read_excel("../data/01.Seoul_Population.xlsx", header = 1, usecols="B, D, G, J, N")
pop_Seoul.head()

/usr/local/Caskroom/miniconda/base/envs/ds_study/lib/python3.8/site-packages/openpyxl/styles/stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

   동별(2)    계 (명)  한국인 (명) 등록외국인 (명) 65세이상고령자 (명)
0  동별(2)       소계       소계        소계           소계
1     소계  9635445  9384739    250706      1768948
2    종로구   150550   139498     11052        29127
3     중구   131812   121602     10210        26302
4    용산구   223433   209849     13584        39671

In [12]:
pop_Seoul.rename(
    columns = {
        pop_Seoul.columns[0]: "구별",
        pop_Seoul.columns[1]: "인구수",
        pop_Seoul.columns[2]: "한국인",
        pop_Seoul.columns[3]: "외국인",
        pop_Seoul.columns[4]: "고령자",
    },
    inplace = True
)
pop_Seoul.head()

      구별      인구수      한국인     외국인      고령자
0  동별(2)       소계       소계      소계       소계
1     소계  9635445  9384739  250706  1768948
2    종로구   150550   139498   11052    29127
3     중구   131812   121602   10210    26302
4    용산구   223433   209849   13584    39671

## Pandas 기초

In [13]:
import pandas as pd
import numpy as np

- pandas는 통상 pd
- numpy는 통상 np

### Series
- index 와 value 로 이루어져 있다.
- 한 가지 데이터 타입만 가질 수 있다.

In [14]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [15]:
pd.Series([1, 2, 3, 4], dtype=np.float64)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [16]:
pd.Series([1, 2, 3, 4], dtype=str)

0    1
1    2
2    3
3    4
dtype: object

In [17]:
pd.Series({"Key": "Value"})

Key    Value
dtype: object

In [18]:
data = pd.Series([1, 2, 3, 4])
data

0    1
1    2
2    3
3    4
dtype: int64

In [19]:
data % 2

0    1
1    0
2    1
3    0
dtype: int64

### 날짜 데이터

In [28]:
dates = pd.date_range("20210101", periods = 6)
dates

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

### DataFrame
- pd.Serires()
    - index, value 로 구성
- pd.DataFrame()
    - index, value, column 으로 구성

In [24]:
# 표준정규분포에서 샘플링한 난수 생성
data = np.random.randn(6, 4)
data

array([[-0.8949434 , -0.55485455, -0.1605549 , -0.24915404],
       [ 0.98903756, -0.25215259,  0.35612287, -0.33706887],
       [ 1.2637027 ,  1.04631991,  0.26373277,  0.10804648],
       [-1.51193665, -1.65693454, -0.3476639 , -1.62507589],
       [-0.03472219,  0.59910413, -0.93853509, -0.91162667],
       [ 0.07871935,  0.127529  , -0.24164099,  0.25604657]])

In [30]:
# DataFrame(data, index, columns)
df = pd.DataFrame(data, index = dates, columns = ["A", "B", "C", "D"])
df

                   A         B         C         D
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047

#### 데이터 프레임 정보 탐색

In [33]:
# df.head(default = 5)
df.head()

                   A         B         C         D
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627

In [34]:
df.tail()

                   A         B         C         D
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047

In [36]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [37]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [38]:
df.values

array([[-0.8949434 , -0.55485455, -0.1605549 , -0.24915404],
       [ 0.98903756, -0.25215259,  0.35612287, -0.33706887],
       [ 1.2637027 ,  1.04631991,  0.26373277,  0.10804648],
       [-1.51193665, -1.65693454, -0.3476639 , -1.62507589],
       [-0.03472219,  0.59910413, -0.93853509, -0.91162667],
       [ 0.07871935,  0.127529  , -0.24164099,  0.25604657]])

- df.info(): 데이터 프레임의 기본 정보 확인

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-01-01 to 2021-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

- df.describe() : 데이터 프레임의 기술통계 정보 확인

In [40]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.018357 -0.115165 -0.178090 -0.459805
std    1.064650  0.949450  0.467326  0.700905
min   -1.511937 -1.656935 -0.938535 -1.625076
25%   -0.679888 -0.479179 -0.321158 -0.767987
50%    0.021999 -0.062312 -0.201098 -0.293111
75%    0.761458  0.481210  0.157661  0.018746
max    1.263703  1.046320  0.356123  0.256047

#### 데이터 정렬
- sort_values()
    - 특정 컬럼을 기준으로 데이터를 정렬

In [41]:
df

                   A         B         C         D
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047

In [45]:
df.sort_values(by="B", ascending=False, inplace = True)

In [46]:
df

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

#### 데이터 선택

In [47]:
df

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

In [48]:
# 한 개 컬럼 선택
df["A"]

2021-01-03    1.263703
2021-01-05   -0.034722
2021-01-06    0.078719
2021-01-02    0.989038
2021-01-01   -0.894943
2021-01-04   -1.511937
Name: A, dtype: float64

In [49]:
type(df["A"])

pandas.core.series.Series

In [50]:
df.A # 컬럼명이 문자인 경우는 "" 괄호 제거 가능

2021-01-03    1.263703
2021-01-05   -0.034722
2021-01-06    0.078719
2021-01-02    0.989038
2021-01-01   -0.894943
2021-01-04   -1.511937
Name: A, dtype: float64

In [51]:
# 두 개 이상 컬럼 선택
df[["A", "B"]]

                   A         B
2021-01-03  1.263703  1.046320
2021-01-05 -0.034722  0.599104
2021-01-06  0.078719  0.127529
2021-01-02  0.989038 -0.252153
2021-01-01 -0.894943 -0.554855
2021-01-04 -1.511937 -1.656935

#### offset index
- [n:m] : n부터 m-1 까지
- 인덱스나 컬럼의 이름으로 slice 하는 경우는 끝을 포함한다.

In [52]:
df

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

In [53]:
df[0:3]

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047

In [54]:
df["20210101":"20210104"]

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

- loc : location
    - index 이름으로 특정 행, 열을 선택

In [55]:
df

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

In [57]:
df.loc[:, ["A", "B"]]

                   A         B
2021-01-03  1.263703  1.046320
2021-01-05 -0.034722  0.599104
2021-01-06  0.078719  0.127529
2021-01-02  0.989038 -0.252153
2021-01-01 -0.894943 -0.554855
2021-01-04 -1.511937 -1.656935

In [61]:
df.loc["20210101":"20210104", ["A", "D"]]

                   A         D
2021-01-03  1.263703  0.108046
2021-01-02  0.989038 -0.337069
2021-01-01 -0.894943 -0.249154
2021-01-04 -1.511937 -1.625076

In [62]:
df.loc["20210102":"20210104", "A":"D"]

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

- iloc : integer location
    - 컴퓨터가 인식하는 인덱스 값으로 선택

In [64]:
df

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

In [65]:
df.iloc[3]

A    0.989038
B   -0.252153
C    0.356123
D   -0.337069
Name: 2021-01-02 00:00:00, dtype: float64

In [66]:
df.iloc[3, 2]

0.3561228745140103

In [67]:
df.iloc[3:5, 0:2]

                   A         B
2021-01-02  0.989038 -0.252153
2021-01-01 -0.894943 -0.554855

In [68]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2021-01-05 -0.034722 -0.938535
2021-01-06  0.078719 -0.241641
2021-01-01 -0.894943 -0.160555

In [69]:
df.iloc[:, 1:3]

                   B         C
2021-01-03  1.046320  0.263733
2021-01-05  0.599104 -0.938535
2021-01-06  0.127529 -0.241641
2021-01-02 -0.252153  0.356123
2021-01-01 -0.554855 -0.160555
2021-01-04 -1.656935 -0.347664

#### condition

In [70]:
df

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

In [72]:
# A 컬럼에서 0보다 큰 숫자(양수)만 선택

df["A"] > 0

2021-01-03     True
2021-01-05    False
2021-01-06     True
2021-01-02     True
2021-01-01    False
2021-01-04    False
Name: A, dtype: bool

In [73]:
df[df["A"] > 0]

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069

In [76]:
df[df > 0]

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05       NaN  0.599104       NaN       NaN
2021-01-06  0.078719  0.127529       NaN  0.256047
2021-01-02  0.989038       NaN  0.356123       NaN
2021-01-01       NaN       NaN       NaN       NaN
2021-01-04       NaN       NaN       NaN       NaN

- NaN : Not a Number

#### 컬럼 추가
- 기존 컬럼이 없으면 추가
- 기존 컬럼이 있으면 수정

In [78]:
df

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

In [81]:
df["E"] = ["one", "two", "three", "four", "five", "six"]
df

                   A         B         C         D      E
2021-01-03  1.263703  1.046320  0.263733  0.108046    one
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627    two
2021-01-06  0.078719  0.127529 -0.241641  0.256047  three
2021-01-02  0.989038 -0.252153  0.356123 -0.337069   four
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154   five
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076    six

#### isin()
특정 요소가 있는지 확인

In [83]:
df["E"].isin(["two"])

2021-01-03    False
2021-01-05     True
2021-01-06    False
2021-01-02    False
2021-01-01    False
2021-01-04    False
Name: E, dtype: bool

In [84]:
df["E"].isin(["two", "three", "four"])

2021-01-03    False
2021-01-05     True
2021-01-06     True
2021-01-02     True
2021-01-01    False
2021-01-04    False
Name: E, dtype: bool

In [85]:
df[df["E"].isin(["two", "three", "four"])]

                   A         B         C         D      E
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627    two
2021-01-06  0.078719  0.127529 -0.241641  0.256047  three
2021-01-02  0.989038 -0.252153  0.356123 -0.337069   four

#### 특정 컬럼 제거
- del
- drop

In [86]:
del df["E"]
df

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

In [88]:
df.drop(["D"], axis = 1) # axis=0 가로, axis=1 세로, default axis = 0

                   A         B         C
2021-01-03  1.263703  1.046320  0.263733
2021-01-05 -0.034722  0.599104 -0.938535
2021-01-06  0.078719  0.127529 -0.241641
2021-01-02  0.989038 -0.252153  0.356123
2021-01-01 -0.894943 -0.554855 -0.160555
2021-01-04 -1.511937 -1.656935 -0.347664

In [90]:
df.drop(["20210104"])

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154

#### apply()

In [91]:
df

                   A         B         C         D
2021-01-03  1.263703  1.046320  0.263733  0.108046
2021-01-05 -0.034722  0.599104 -0.938535 -0.911627
2021-01-06  0.078719  0.127529 -0.241641  0.256047
2021-01-02  0.989038 -0.252153  0.356123 -0.337069
2021-01-01 -0.894943 -0.554855 -0.160555 -0.249154
2021-01-04 -1.511937 -1.656935 -0.347664 -1.625076

In [92]:
df["A"].apply("sum")

-0.11014261011560555

In [93]:
df["A"].apply("mean")

-0.018357101685934258

In [94]:
df["A"].apply("min"), df["A"].apply("max")

(-1.5119366463887578, 1.2637027034751178)

In [95]:
df[["A", "D"]].apply("sum")

A   -0.110143
D   -2.758832
dtype: float64

In [96]:
df["A"].apply(np.sum)

2021-01-03    1.263703
2021-01-05   -0.034722
2021-01-06    0.078719
2021-01-02    0.989038
2021-01-01   -0.894943
2021-01-04   -1.511937
Name: A, dtype: float64

In [98]:
def plusminus(num):
    return "plus" if num > 0  else "minus"

In [100]:
df["A"].apply(plusminus)

2021-01-03     plus
2021-01-05    minus
2021-01-06     plus
2021-01-02     plus
2021-01-01    minus
2021-01-04    minus
Name: A, dtype: object

In [101]:
df["A"].apply(lambda num: "plus" if num > 0  else "minus")

2021-01-03     plus
2021-01-05    minus
2021-01-06     plus
2021-01-02     plus
2021-01-01    minus
2021-01-04    minus
Name: A, dtype: object